app/controllers/wishes_controller.rb

  def index
    @wishes = Wish.where(user_id: current_user.id)
---
SELECT "wishes".* FROM "wishes" WHERE "wishes"."user_id" = 1

  def create
    @wish = Wish.new(wish_params)
    @wish.save
---
INSERT INTO "wishes" ("venue_name", "venue_photo", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @wish = Wish.find(params[:id])
    @wish.destroy
---
SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "wishes" WHERE "wishes"."id" = ?  [["id", 1]]